[
  {
    "id": "redesign-site-ufc-quixada",
    "status": "published",
    "name": "Redesign Site UFC Quixadá",
    "title": "Facilitando o acesso à informação para a comunidade acadêmica",
    "caption": "Reorganização e o redesign do site da Universidade Federal do Ceará, campus Quixadá. A página é um agregador de informações para alunos, professores e a comunidade em geral, e o objetivo é permitir que os usuários encontrem facilmente o que procuram.",
    "year": 2025,
    "myRole": "Lead UX/UI Designer, Pesquisador",
    "tags": ["UX Design", "Arquitetura da Informação", "Responsividade", "Usabilidade"],
    "techniquesAndTools": [
      "Figma",
      "Trello",
      "Google Planilhas",
      "Questionário",
      "Avaliação heurística"
    ],
    "completeCase": { "href": null, "title": "Em breve" },
    "coverImage": {
      "url": "/media/projects/site-ufc/thumbnail.png",
      "alt": "Proposta de interface para a página inicial do site da UFC Quixadá, com destaque para a navegação simplificada."
    },
    "content": [
      {
        "type": "heading",
        "level": 2,
        "text": "Contexto"
      },
      {
        "type": "text",
        "paragraph": "A vida universitária exige que o estudante esteja a par de um volume grande de informações: datas de provas, eventos, editais, bolsas e notícias são só algumas das mais importantes. A UFC Quixadá, como parte da Universidade Federal do Ceará, tem a responsabilidade de fornecer essas informações de forma clara e fácil de achar."
      },
      {
        "type": "heading",
        "level": 3,
        "text": "O desafio"
      },
      {
        "type": "text",
        "paragraph": "Uma breve olhada na página atual <a href=https://www.quixada.ufc.br/' target=_blank>página atual</a> já revela os maiores problemas: navegação confusa, falta de responsividade, inconsistência de layout, excesso de informação e busca ineficiente.<br><br>Com base em questionários e entrevistas com alunos, além de uma avaliação heurística, ficou claro que as maiores demandas de redesign eram: melhorar a arquitetura da informação e a navegação, padronizar os estilos de página e tornar o site responsivo."
      },
      {
        "type": "image",
        "url": "/media/projects/site-ufc/questionaire-data.png",
        "alt": "Gráfico dos problemas mais comuns identificados no questionário. Os resultados destacam uma maioria para a dificuldade em encontrar informações específicas, seguida por menus confusos e links quebrados."
      },
      {
        "type": "heading",
        "level": 3,
        "text": "O plano"
      },
      {
        "type": "text",
        "paragraph": "As maiores reclamações dos respondentes do questionário incluíam a dificuldade em encontrar informações específicas (alguns mencionaram que buscam informações do site pelo navegador ao invés de navegar por ele), a sobrecarga de informações (excesso de texto, pouca hierarquia visual e o menu de navegação extenso faz com que a busca por informações seja onerosa) e a inconsistência na experiência (o menu de navegação muda entre as versões de desktop e mobile e as informações em cada versão são diferentes).<br><br>A avaliação heurística ajudou a confirmar essas dores, apontando problemas de usabilidade como falta de feedback visual, problemas de consistência e padrões, e a ausência de uma hierarquia clara de informações."
      },
      {
        "type": "heading",
        "level": 3,
        "text": "(Re)desenhando o menu"
      },
      {
        "type": "text",
        "paragraph": "O primeiro passo foi reorganizar a estrutura das informações do menu de navegação. Como ele possui uma quantidade grande de informações (que são necessárias, então sem chance de simplesmente jogar algumas delas fora), precisamos pensar em uma forma de exibir a informação de uma forma mais digerível.<br><br>A abordagem escolhida foi de realocá-lo para o topo da página, abaixo do cabeçalho; assim, ele se torna visível a qualquer momento durante a navegação e o usuário não precisa rolar a página até achar o que deseja. Também foi necessário renomear, reorganizar e agrupar alguns menus em uma tentativa de fazer com que os submenus fizessem mais sentido e que a informação pudesse ser visualizada em chunks menores e mais fáceis de digerir."
      },
      {
        "type": "image",
        "url": "/media/projects/site-ufc/new-menu.png",
        "alt": "Redesign do menu de navegação."
      },
      {
        "type": "heading",
        "level": 3,
        "text": "Consistência e hierarquia visual"
      },
      {
        "type": "text",
        "paragraph": "Reorganizado o menu, passamos para um redesenho total da interface. Usando variáveis de cores, tipografia e espaçamento de forma consistente, conseguimos criar uma hierarquia visual clara de informações com um número reduzido de estilizações e componentes necessários.<br><br>Além disso, com o controle de variáveis, conseguimos garantir que o site seja responsivo e adaptável a diferentes tamanhos de tela, mantendo a consistência visual em todas as versões. O projeto foi desenvolvido no Figma, onde criamos um guia de estilo e um protótipo interativo para testes de usabilidade."
      },
      {
        "type": "image",
        "url": "/media/projects/site-ufc/variables.png",
        "alt": "Redesign do menu de navegação."
      },
      {
        "type": "heading",
        "level": 3,
        "text": "Próximos passos"
      },
      {
        "type": "text",
        "paragraph": "O projeto ainda está em andamento, mas com feedback positivo de outros membros de equipe e usuários. O próximo passo é a realização de testes de usabilidade com usuários para validar se as mudanças facilitam a encontrabilidade da informação e se a proposta de redesign do menu realmente melhora a navegação.<br><br>Uma vez validadas as mudanças, o plano é convencer as autoridades da universidade a implementar o redesign no site oficial, garantindo que a comunidade acadêmica tenha acesso a uma plataforma mais eficiente e agradável de usar."
      }
    ]
  },
  {
    "id": "sistema-multiplataforma-para-restaurantes",
    "status": "hidden",
    "name": "Sistema multiplataforma para restaurantes",
    "title": "Experiência fluida para restaurantes e clientes",
    "caption": "Este projeto é de um sistema white label para que restaurantes gerenciem mesas, clientes, pedidos e entregas. A plataforma envolve três sistemas principais: uma plataforma de gestão, uma plataforma para garçons e uma plataforma para clientes fazerem acessarem o menu e fazerem pedidos em mesa.",
    "year": 2024,
    "myRole": "Lead UX/UI Designer",
    "tags": ["UX Design", "UI Design", "Multiplataforma", "Responsividade"],
    "techniquesAndTools": ["Figma", "Obsidian", "Benchmarking", "Atomic Design"],
    "coverImage": {
      "url": "/media/projects/placeholder.jpg",
      "alt": "Tela inicial do aplicativo de receitas com imagens de pratos coloridos."
    },
    "content": [
      {
        "type": "heading",
        "level": 2,
        "text": "Contexto"
      },
      {
        "type": "text",
        "paragraph": "Com a popularização dos aplicativos de entrega de comida, fazer pedidos tornou-se uma tarefa rápida e direta. Essa facilidade também pode ser aproveitada em restaurantes; este sistema permite que restaurantes ofereçam uma experiência similar para seus clientes ao fazer pedidos em mesa, sem a necessidade de um aplicativo."
      },
      {
        "type": "image",
        "url": "/media/projects/placeholder.avif",
        "alt": "Diagrama de fluxo de usuário para o aplicativo de receitas."
      },
      {
        "type": "heading",
        "level": 2,
        "text": "O desafio"
      },
      {
        "type": "text",
        "paragraph": "Após uma análise de concorrentes e similares, duas coisas tornaram-se claras: o cliente final quer fazer pedidos sem fluxos extensos ou baixar aplicativos dedicados e os restaurantes precisam de um sistema robusto para gerenciar pedidos e mesas."
      },
      {
        "type": "heading",
        "level": 3,
        "text": "A solução prevista"
      },
      {
        "type": "text",
        "paragraph": "Usamos o Framework <a href=https://quasar.dev/ target=_blank class=project-link>Quasar</a>, que nos forneceu a maioria dos componentes que precisávamos. Com alguns ajustes adicionais e a montagem de uma guia de estilo, em menos de duas semanas já tinhamos uma base responsiva e ajustável que nos permitiu focar apenas na interação.<br><br>Para os restaurantes, o foco foi em projetar um sistema multiplataforma que integra gestão, balcão e garçons. Para os clientes, um cardápio virtual acessível via QR code de rápido e fácil acesso. Ele deve permitir a realização e o acompanhamento de pedidos em mesa e a inclusão de vários clientes em um único pedido."
      },
      {
        "type": "heading",
        "level": 3,
        "text": "A briga"
      },
      {
        "type": "text",
        "paragraph": "O maior desafio foi o <strong>painel de mesas</strong>. Ele é a parte central do sistema para restaurantes e precisava ser robusto o suficiente para um número de mesas que pode variar entre poucas unidades a dezenas."
      },
      {
        "type": "heading",
        "level": 3,
        "text": "O insight"
      },
      {
        "type": "text",
        "paragraph": "Usar o Quasar me deu um ideia: <strong>Densidade</strong>. Alguns componentes têm variações menores que permitem que mais informação seja exibida. Depois de uma série de iterações e testes, essa noção me deu a ideia de aplicar o mesmo conceito nos cards de mesa: três níveis de densidade, que funcionam como um zoom.<br><br>O funcionário no balcão pode, com um clique, alternar entre uma visualização detalhada de mesas e um panorama geral das mesas do restaurante."
      },
      {
        "type": "image",
        "url": "/media/projects/placeholder.avif",
        "alt": "Montagem das telas principais do aplicativo de receitas."
      },
      {
        "type": "heading",
        "level": 2,
        "text": "Resultados"
      },
      {
        "type": "text",
        "paragraph": "A definição de um padrão para o comportamento das telas se revelou um catalizador de atividades, permitindo que eu pudesse usar o tempo para me dedicar em desenhar as funcionalidades mais importantes. Eventualmente, o projeto expandiu para incluir funcionalidades de delivery e pedidos à distância, para as quais o sistema já estava preparado para receber sem grandes ajustes.<br><br>Usar um framework permitiu minimizar a criação de novos componentes, acelerando o processo de design e desenvolvimento. A ideia de aplicar a mesma lógica de densidade para o painel de mesas foi um divisor de águas, permitindo que o sistema fosse escalável e adaptável a diferentes tamanhos de restaurantes."
      },
      {
        "type": "heading",
        "level": 3,
        "text": "O que aprendemos"
      },
      {
        "type": "text",
        "paragraph": "Restrições de projeto podem ser encaradas como um exercício em tirar o melhor proveito de um recurso disponível. Entender a filosofia de design de um framework permite uma menor fricção durante o processo criativo, facilitando a exploração de soluções dentro dos limites estabelecidos e garantindo trabalho adicional só seja realizado quando necessário."
      }
    ]
  },
  {
    "id": "va-la-facilitando-o-emprestimo-de-ferramentas",
    "status": "published",
    "name": "VáLá: facilitando o empréstimo de ferramentas",
    "title": "Facilitando o empréstimo de ferramentas entre coterrâneos",
    "caption": "Projeto de um aplicativo de smartphone para facilitar o empréstimo de ferramentas entre usuários com o objetivo de promover colaboração, sustentabilidade e um pouco de renda extra para os locadores.",
    "year": 2024,
    "myRole": "Lead UX/UI Designer, Pesquisador",
    "tags": ["UX Design", "Mobile", "Aplictivo", "Desenvolvimento"],
    "techniquesAndTools": ["Figma", "Questionário", "Material Design", "React Native", "Expo"],
    "completeCase": { "href": null, "title": "Em breve" },
    "coverImage": {
      "url": "/media/projects/va-la/thumbnail.png",
      "alt": "Proposta de interface para o app VáLá."
    },
    "content": [
      {
        "type": "heading",
        "level": 2,
        "text": "Contexto"
      },
      {
        "type": "text",
        "paragraph": "Cidades universitárias frequentemente recebem alunos de outros municípios. Muitas vezes, a mudança de cidade é acompanhada de uma nova realidade: a de morar sozinho.<br><br>Pensando nesses alunos e em pessoas que precisam fazer pequenos reparos em casa, o aplicativo VáLá foi pensado para permitir que não só universitários, mas também moradores locais, possam emprestar e alugar ferramentas de forma prática e rápida."
      },
      {
        "type": "heading",
        "level": 3,
        "text": "O plano"
      },
      {
        "type": "text",
        "paragraph": "Para entender como melhor conectar locadores e loctatários, realizamos um questionário com usuários potenciais, no qual perguntamos sobre suas necessidades, preferências e expectativas em relação ao aplicativo. As respostas nos ajudaram a definir as funcionalidades principais do aplicativo e a criar uma experiência de usuário intuitiva e agradável."
      },
      {
        "type": "heading",
        "level": 3,
        "text": "O insight"
      },
      {
        "type": "text",
        "paragraph": "Munidos de informações sobre as expectativas e necessidades de nossos futuros usuários, começamos a trabalhar no design do aplicativo. A ideia era criar uma interface simples e funcional, que permitisse aos usuários encontrar facilmente as ferramentas que precisavam e entrar em contato com os locadores.<br><br>Depois de muitas iterações, discussões e análise de semelhantes e concorrentes, chegamos ao produto que melhor funcionava dado o escopo: um <strong>marketplace</strong>. Produto definido, passamos a escrever os requisitos do aplicativo e a criar o protótipo de alta fidelidade no Figma, desenhando as interfaces principais e anotando os fluxos de usuário."
      },
      {
        "type": "image",
        "url": "/media/projects/va-la/user-flow.png",
        "alt": "Documentação do fluxo de solicitação de aluguel de ferramenta."
      },
      {
        "type": "heading",
        "level": 3,
        "text": "O pulo do gato"
      },
      {
        "type": "text",
        "paragraph": "Ao nos direcionarmos para o desenvolvimento de um marketplace, a primeira mudança drástica foi separar a experiência de locador e locatário na forma aplicativos distintos para cada um. Isso permitiu que cada usuário tivesse uma experiência mais simples e menos poluída.<br><br>Focando primeiramente no locatário, o aplicativo permite que ele encontre ferramentas e equipamentos próximos, solicite o aluguel mediante um prazo combinado, retire ou receba o equipamento em casa, gerencie o seu pedido, faça o pagamento e a devolução."
      },
      {
        "type": "heading",
        "level": 3,
        "text": "O MVP"
      },
      {
        "type": "text",
        "paragraph": "A versão 1.0 do aplicativo VáLá Cliente foi desenvolvida usando React Native e Expo, o que nos permitiu criar um aplicativo multiplataforma com uma base sólida e escalável. Um bom documento de requisitos, os componentes do Material Design e o uso de variáveis de estilo nos permitiram criar uma interface consistente e agradável, além de facilitar a manutenção e a evolução do aplicativo."
      },
      {
        "type": "image",
        "url": "/media/projects/va-la/mvp.png",
        "alt": "Redesign do menu de navegação."
      },
      {
        "type": "heading",
        "level": 3,
        "text": "O que aprendemos"
      },
      {
        "type": "text",
        "paragraph": "Projeto de produto não é só sobre design. Além de entender as necessidades dos usuários, o mercado e as limitações técnicas, é preciso juntar um time para tornar uma ideia em algo concreto. Trabalhar com desenvolvimento, mesmo que em um projeto fictício trouxe algumas reflexões importantes: a importância de um bom documento de requisitos, a necessidade de uma base sólida e escalável para o aplicativo e a importância de um design consistente e agradável.<br><br>O projeto VáLá é um exemplo de como o design não se faz sem considerar também quem desenvolve. É preciso entender as limitações e possibilidades da tecnologia para criar uma experiência de usuário que seja viável e sustentável."
      }
    ]
  },
  {
    "id": "identidade-visual-mago-do-espaco",
    "status": "published",
    "name": "Identidade visual Mago do Espaço",
    "title": "Projeto de identidade visual para um portal esotérico",
    "caption": "Desenvolvimento de sistema de identidade visual para um portal de notícias esotéricas.",
    "year": 2024,
    "myRole": "Designer Gráfico",
    "tags": ["Design gráfico", "Redes sociais", "Identidade visual", "Marca"],
    "techniquesAndTools": ["Adobe Illustrator", "Figma"],
    "coverImage": {
      "url": "/media/projects/mago-do-espaco/thumbnail.png",
      "alt": "Logomarca do Mago do Espaço em plano central, com uma padronagem de estrelas e luas no fundo."
    },
    "completeCase": { "href": null, "title": "Em breve" },
    "content": [
      {
        "type": "heading",
        "level": 2,
        "text": "Contexto"
      },
      {
        "type": "text",
        "paragraph": "O portal Mago do Espaço é um lugar onde o místico e o esotérico se encontram com a informação. Se aproveitando do interesse por temas esotéricos, a página precisava de uma identidade que refletisse essa atmosfera mágica e envolvente."
      },
      {
        "type": "heading",
        "level": 3,
        "text": "Formando o conceito"
      },
      {
        "type": "text",
        "paragraph": "Por meio de entrevista e formulário de briefing, pude ter uma visão clara das expectativas e necessidades do cliente. Após a construções de moodboards e conceitos iniciais, conseguimos estabelecer um direcionamento para a marca: Estilo ilustrativo, inspirado em ilustrações medievais, com ar místico e misterioso; imagens que remetem à alquimia, astrologia e magia; cores fortes, metálicas e tons de sépia; tipografia gótica e manuscrita, com um toque de modernidade."
      },
      {
        "type": "image",
        "url": "/media/projects/mago-do-espaco/moodboard.png",
        "alt": "Mapa do site da plataforma ConnectHelp."
      },
      {
        "type": "heading",
        "level": 3,
        "text": "A marca"
      },
      {
        "type": "text",
        "paragraph": "A logomarca principal consiste na combinação de logotipo com marca gráfica. A tipografia gótica e delicada remete a escritos medievais com uma leveza que evoca o tema místico e cósmico.<br><br>O símbolo, um gato em pose heráldica que representa familiares de magos e bruxas, a constelação felina do Lince e criaturas mitológicas como Cait Sith e Nekomata, é um curioso caçador  noturno, ligado ao espiritual e ao desconhecido."
      },
      {
        "type": "image",
        "url": "/media/projects/mago-do-espaco/logo.png",
        "alt": "Dashboard de uma ONG na plataforma ConnectHelp, mostrando vagas e voluntários."
      },
      {
        "type": "heading",
        "level": 3,
        "text": "Assinaturas"
      },
      {
        "type": "text",
        "paragraph": "A partir da assinatura principal, outras assinaturas foram desenvolvidas, cada uma com um propósito e local de aplicação diferente. A paleta de cores foi escolhida para remeter às cores usadas em iluminuras, evocando magia e realeza, ao mesmo tempo que se conecta com o tema cósmico. A tipografia é uma combinação de fontes góticas e manuscritas, que trazem um ar de mistério e tradição."
      },
      {
        "type": "image",
        "url": "/media/projects/mago-do-espaco/sample.png",
        "alt": "Exemplos de aplicação da marca utilizando suas assinaturas."
      },
      {
        "type": "heading",
        "level": 2,
        "text": "O que aprendemos"
      },
      {
        "type": "text",
        "paragraph": "Um aspecto fácil de ignorar é a aplicabilidade da marca. A interação com o cliente, por meio de entrevista e de seus insights, permitiu que eu realizasse o projeto mantendo sempre em mente que a marca seria usada em aplicações digitais.<br><br>A identidade foi desenvolvida considerando que a marca deveria ser flexível e adaptável, funcionando em diferentes contextos e mídias: imagens para redes sociais, uso em interface de páginas e até em ícones de navegador. Com um sistema de identidade visual robusto, o cliente tem tudo o que precisa para aplicar a marca de forma consistente e eficaz e com facilidade."
      }
    ]
  }
]
